{
  "format": "layers-model",
  "generatedBy": "keras v3.9.2",
  "convertedBy": "TensorFlow.js Converter v4.22.0",
  "modelTopology": {
    "keras_version": "3.9.2",
    "backend": "tensorflow",
    "model_config": {
      "class_name": "Functional",
      "config": {
        "name": "cat_mood_cnn",
        "trainable": true,
        "layers": [
          {
            "class_name": "InputLayer",
            "config": {
              "batchInputShape": [
                null,
                128,
                128,
                3
              ],
              "dtype": "float32",
              "sparse": false,
              "ragged": false,
              "name": "input"
            },
            "name": "input",
            "inbound_nodes": []
          },
          {
            "class_name": "Conv2D",
            "config": {
              "name": "conv1",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              },
              "filters": 16,
              "kernel_size": [
                3,
                3
              ],
              "strides": [
                1,
                1
              ],
              "padding": "valid",
              "data_format": "channels_last",
              "dilation_rate": [
                1,
                1
              ],
              "groups": 1,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "module": "keras.initializers",
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                },
                "registered_name": null
              },
              "bias_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "conv1",
            "inbound_nodes": [
              [
                [
                  {
                    "args": [
                      {
                        "class_name": "__keras_tensor__",
                        "config": {
                          "shape": [
                            null,
                            128,
                            128,
                            3
                          ],
                          "dtype": "float32",
                          "keras_history": [
                            "input",
                            0,
                            0
                          ]
                        }
                      }
                    ],
                    "kwargs": {}
                  }
                ]
              ]
            ]
          },
          {
            "class_name": "MaxPooling2D",
            "config": {
              "name": "pool1",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              },
              "pool_size": [
                2,
                2
              ],
              "padding": "valid",
              "strides": [
                2,
                2
              ],
              "data_format": "channels_last"
            },
            "name": "pool1",
            "inbound_nodes": [
              [
                [
                  {
                    "args": [
                      {
                        "class_name": "__keras_tensor__",
                        "config": {
                          "shape": [
                            null,
                            126,
                            126,
                            16
                          ],
                          "dtype": "float32",
                          "keras_history": [
                            "conv1",
                            0,
                            0
                          ]
                        }
                      }
                    ],
                    "kwargs": {}
                  }
                ]
              ]
            ]
          },
          {
            "class_name": "Conv2D",
            "config": {
              "name": "conv2",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              },
              "filters": 32,
              "kernel_size": [
                3,
                3
              ],
              "strides": [
                1,
                1
              ],
              "padding": "valid",
              "data_format": "channels_last",
              "dilation_rate": [
                1,
                1
              ],
              "groups": 1,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "module": "keras.initializers",
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                },
                "registered_name": null
              },
              "bias_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "conv2",
            "inbound_nodes": [
              [
                [
                  {
                    "args": [
                      {
                        "class_name": "__keras_tensor__",
                        "config": {
                          "shape": [
                            null,
                            63,
                            63,
                            16
                          ],
                          "dtype": "float32",
                          "keras_history": [
                            "pool1",
                            0,
                            0
                          ]
                        }
                      }
                    ],
                    "kwargs": {}
                  }
                ]
              ]
            ]
          },
          {
            "class_name": "GlobalAveragePooling2D",
            "config": {
              "name": "gap",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              },
              "data_format": "channels_last",
              "keepdims": false
            },
            "name": "gap",
            "inbound_nodes": [
              [
                [
                  {
                    "args": [
                      {
                        "class_name": "__keras_tensor__",
                        "config": {
                          "shape": [
                            null,
                            61,
                            61,
                            32
                          ],
                          "dtype": "float32",
                          "keras_history": [
                            "conv2",
                            0,
                            0
                          ]
                        }
                      }
                    ],
                    "kwargs": {}
                  }
                ]
              ]
            ]
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense1",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              },
              "units": 64,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "module": "keras.initializers",
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                },
                "registered_name": null
              },
              "bias_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "dense1",
            "inbound_nodes": [
              [
                [
                  {
                    "args": [
                      {
                        "class_name": "__keras_tensor__",
                        "config": {
                          "shape": [
                            null,
                            32
                          ],
                          "dtype": "float32",
                          "keras_history": [
                            "gap",
                            0,
                            0
                          ]
                        }
                      }
                    ],
                    "kwargs": {}
                  }
                ]
              ]
            ]
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "output",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              },
              "units": 6,
              "activation": "softmax",
              "use_bias": true,
              "kernel_initializer": {
                "module": "keras.initializers",
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                },
                "registered_name": null
              },
              "bias_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "output",
            "inbound_nodes": [
              [
                [
                  {
                    "args": [
                      {
                        "class_name": "__keras_tensor__",
                        "config": {
                          "shape": [
                            null,
                            64
                          ],
                          "dtype": "float32",
                          "keras_history": [
                            "dense1",
                            0,
                            0
                          ]
                        }
                      }
                    ],
                    "kwargs": {}
                  }
                ]
              ]
            ]
          }
        ],
        "input_layers": [
          [
            "input",
            0,
            0
          ]
        ],
        "output_layers": [
          [
            "output",
            0,
            0
          ]
        ]
      }
    },
    "training_config": {
      "loss": "categorical_crossentropy",
      "loss_weights": null,
      "metrics": [
        "accuracy"
      ],
      "weighted_metrics": null,
      "run_eagerly": false,
      "steps_per_execution": 1,
      "jit_compile": false,
      "optimizer_config": {
        "class_name": "Adam",
        "config": {
          "name": "adam",
          "learning_rate": 0.0010000000474974513,
          "weight_decay": null,
          "clipnorm": null,
          "global_clipnorm": null,
          "clipvalue": null,
          "use_ema": false,
          "ema_momentum": 0.99,
          "ema_overwrite_frequency": null,
          "loss_scale_factor": null,
          "gradient_accumulation_steps": null,
          "beta_1": 0.9,
          "beta_2": 0.999,
          "epsilon": 1e-07,
          "amsgrad": false
        }
      }
    }
  },
  "weightsManifest": [
    {
      "paths": [
        "group1-shard1of1.bin"
      ],
      "weights": [
        {
          "name": "conv1/kernel",
          "shape": [
            3,
            3,
            3,
            16
          ],
          "dtype": "float32"
        },
        {
          "name": "conv1/bias",
          "shape": [
            16
          ],
          "dtype": "float32"
        },
        {
          "name": "conv2/kernel",
          "shape": [
            3,
            3,
            16,
            32
          ],
          "dtype": "float32"
        },
        {
          "name": "conv2/bias",
          "shape": [
            32
          ],
          "dtype": "float32"
        },
        {
          "name": "dense1/kernel",
          "shape": [
            32,
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "dense1/bias",
          "shape": [
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "output/kernel",
          "shape": [
            64,
            6
          ],
          "dtype": "float32"
        },
        {
          "name": "output/bias",
          "shape": [
            6
          ],
          "dtype": "float32"
        }
      ]
    }
  ]
}